let str = "";
//* Вивести в консоль в один рядок через кому числа від 10 до 20.
// for(let a = 10; a <= 20; a++){
//   a <= 19 ? str += a + ', ' : str += a + '.'
// }
//* Вивести в консоль в один рядок через кому квадрати чисел від 10 до 20.
// for(let b = 10; b <= 20; b++){
//   b <= 19 ? str += b**2 + ', ' : str += b**2 + '.'
// }
//* Знайти добуток усіх цілих чисел від 15 до 35.
// let int = 1;
// for(let c = 15; c <= 35; c++){
//   int *= c;
// }
// console.log(int);
//* Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
// let sum = 0;
// for(let d = 0; d <= 500; d++){
//   sum += d;
// }
// const average = sum / 500;
// console.log(average);
//* Вивести суму лише парних чисел в діапазоні від 30 до 80.
// let sum = 0;
// for(let e = 30; e <= 80; e++){
//   if(e % 2 === 0){
//     sum += e;
//   }
// }
// console.log(sum);
//* Вивести всі числа в діапазоні від 100 до 200 кратні 3.
// for(let f = 100; f < 200; f++){
//   if(f % 3 === 0){
//     console.log(f);
//   }
// }
//* Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
let num = parseInt(prompt("Enter number"));
let isPrime = true;
if(num <= 1){
  isPrime = false;
}
for(let g = 2; g < num; g++){
  if(num % g === 0){
    isPrime = false;
    break;
  }
}
console.log(isPrime);